In [1]:
import MySQLdb

In [2]:
db = MySQLdb.connect(
    host="52.78.107.76",
    user="root",
    passwd="dss",
    db="world",
    charset="utf8")

db

In [6]:
Query = """
    Show Tables;
"""

In [7]:
curs = db.cursor()
curs.execute(Query)

10

### 1) country 테이블에서 몇 개의 대률이 있는지 조회하세요

In [8]:
Query = """
    Select count(distinct(Continent)) as count
    From country;
"""

In [9]:
df = pd.read_sql(Query, db)
df

   count
0      7

### 2) country 테이블에서 Continent(대륙)별 몇개의 나라가 있는지 조회하세요.

In [14]:
Query = """
    Select Continent, count(Continent) as count
    From country
    Group by Continent
    Order by count desc;
"""

In [15]:
df = pd.read_sql(Query, db)
df

       Continent  count
0         Africa     58
1           Asia     51
2         Europe     46
3  North America     37
4        Oceania     28
5  South America     14
6     Antarctica      5

### 3) city 테이블에서 국가코드(CountryCode) 별로 총인구가 몇명인지 조회하고 총인구 순으로 내림차순하세요.(총인구가 5천만 이상인 도시만 출력)

In [23]:
Query = """
        Select CountryCode, sum(Population) as Population
        From city
        Group by CountryCode
        Having Population >= 50000000
        Order by Population desc;
        
"""

In [24]:
df = pd.read_sql(Query, db)
df

  CountryCode   Population
0         CHN  175953614.0
1         IND  123298526.0
2         BRA   85876862.0
3         USA   78625774.0
4         JPN   77965107.0
5         RUS   69150700.0
6         MEX   59752521.0

### 4) countrylanguage 테이블에서 언어별 사용하는 국가수를 조회하고 많이 사용하는 언어를 5위에서 10위까지조회하세요.

In [35]:
Query = """
        Select Language, count(CountryCode) as count
        From countrylanguage
        Group by Language
        Order by count desc, Language
        Limit 4, 6;
        
"""

In [36]:
df = pd.read_sql(Query, db)
df

         Language  count
0         Chinese     19
1          German     19
2         Russian     17
3         Italian     15
4  Creole English     14
5             Ful     12

### 5) countrylanguage 테이블에서 언어별 15개 국가 이상에서 사용되는 언어를 조회하고 언어별 국가수에 따라내림차순하세요.

In [44]:
Query = """
    Select Language, count(CountryCode) as count
    From countrylanguage
    Group by Language
    Having count >= 15
    Order by count DESC
"""

In [45]:
df = pd.read_sql(Query, db)
df

  Language  count
0  English     60
1   Arabic     33
2  Spanish     28
3   French     25
4  Chinese     19
5   German     19
6  Russian     17
7  Italian     15

### 6) country 테이블에서 대륙별 전체 표면적크기를 구하고 표면적 크기 순으로 내림차순하세요.

In [11]:
Query = """
    Select Continent, Sum(SurfaceArea) as SurfaceArea
    From country
    Group by Continent
    Order by SurfaceArea DESC

"""

In [12]:
df = pd.read_sql(Query, db)
df

       Continent  SurfaceArea
0           Asia   31881005.0
1         Africa   30250377.0
2  North America   24214470.0
3         Europe   23049133.9
4  South America   17864926.0
5     Antarctica   13132101.0
6        Oceania    8564294.0